The sketched Structural Rebar element has too many segments to be properly parameterized. Please reduce the number of segments.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TooFewParamsForSketch { get; }
  Visual Basic
Public Shared ReadOnly Property TooFewParamsForSketch As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TooFewParamsForSketch {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace